
/* Задача №1. Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя).

Console.Write("Input number: ");
int number = Convert.ToInt32(Console.ReadLine());

int kvadrat = number * number;

Console.WriteLine("The quad of " + number + " is " + kvadrat);

Console.WriteLine($"The quad of {number} is {kvadrat}");
*/
